# Dotfiles dependencies
# Install with: brew bundle
# Generated from current system setup

# === Required ===
brew "stow"              # Symlink manager for dotfiles

# === Shell & Terminal ===
brew "atuin"             # Better shell history with sync
brew "fzf"               # Fuzzy finder
# brew "zoxide"          # Smarter cd (optional)

# === Development Tools ===
brew "node@22"           # Node.js 22 LTS
brew "openjdk@21"        # Java 21 LTS
brew "protobuf"          # Protocol buffers
brew "golang-migrate"    # Database migrations

# === CLI Tools ===
brew "jq"                # JSON processor
brew "lazygit"           # Git TUI
brew "kubectx"           # Kubernetes context switcher
brew "mole"              # SSH tunneling
brew "yt-dlp"            # YouTube downloader
brew "whisper-cpp"       # Speech recognition
brew "duti"              # Default app setter
brew "mas"               # Mac App Store CLI

# === Media ===
brew "ffmpeg"            # Video/audio processing
brew "libass"            # Subtitle rendering
brew "libpq"             # PostgreSQL library
brew "gnutls"            # TLS library
brew "pango"             # Text rendering

# === Custom Taps ===
tap "felixkratz/formulae"
brew "felixkratz/formulae/borders"  # macOS window borders

tap "anomalyco/tap"
brew "anomalyco/tap/opencode"       # OpenCode CLI

# === GUI Applications ===
cask "aerospace"         # Tiling window manager
cask "stats"             # System monitor in menu bar
# cask "appcleaner"      # App uninstaller
# cask "asset-catalog-tinkerer"  # Xcode asset viewer

# === Optional Modern CLI Replacements ===
# Uncomment to install
# brew "eza"             # Modern ls
# brew "bat"             # Modern cat
# brew "fd"              # Modern find
# brew "ripgrep"         # Modern grep
# brew "git-delta"       # Better git diff
# brew "bottom"          # System monitor
# brew "k9s"             # Kubernetes TUI
# brew "gh"              # GitHub CLI
